{
    "adventures": [
        {
            "config": {
                "audio": {
                    "autoPlay": true,
                    "hideControls": true,
                  "path": "https://s3.us-east-2.amazonaws.com/thesatanic.estate/music/lounge11loop.mp3"
                }
            },
            "rooms": [
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "subway"
                            ],
                            "text": "Oh No, Not Again"
                        },
                        {
                            "nextRoom": [
                                "library"
                            ],
                            "text": "Am I dead?"
                        }
                    ],
                    "id": "brick",
                    "name": "Nothing",
                    "text": "You see nothing, you feel nothing, you taste nothing, you smell nothing. You hear that goddamned music."
                },
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "train"
                            ],
                            "text": "Every Year!"
                        },
                        {
                            "nextRoom": [
                                "sleepingPorch"
                            ],
                            "text": "Evaporate"
                        }
                    ],
                    "id": "subway",
                    "name": "The Waiting",
                    "text": "As the music drones on you begin to wonder if there are others, out there, in The Waiting. No one ever mentions the waiting. Yet you always seem to end up here one way or another."
                },
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "station"
                            ],
                            "text": "Start Crawling"
                        },
                        {
                            "nextRoom": [
                                "cemetery"
                            ],
                            "text": "Panic"
                        }
                    ],
                    "id": "train",
                    "name": "sometimes nothing breaks",
                    "text": "A pinpoint of light appears in your perepheral vision. Sensations of coldness and damp begin to creep over you, followed by the smell of earth, the feeling of grit in your teeth."
                },
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "cabin"
                            ],
                            "text": "Looks Familiar"
                        },
                        {
                            "nextRoom": [
                                "frontParlor"
                            ],
                            "text": "I'm Lost"
                        }
                    ],
                    "id": "station",
                    "name": "the Something",
                    "text": "No choice but to claw your way back to reality. Slowly, you begin to move. The dirt is heavy. It will take along time. Through the dirt and worms and muck and slime, past bone and midden, through remnents of long dead civilizations and into labyrinthian tunnels carved by the entirely forgotten you slowly make your way towards the Something."
                },
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "trapDoor"
                            ],
                            "text": "Get out"
                        },
                        {
                            "nextRoom": [
                                "sleepingPorch"
                            ],
                            "text": "Explore Cave"
                        }
                    ],
                    "id": "station",
                    "name": "It was only the end of the world again",
                    "text": "You claw and scramble through the nothing and it begins to take shape. You can't tell how large the cavern is, but you know its big. Every little sound echoes. The sound of water driping from stalactites count time. The cave would be so much faster with wings, probably more dangerous though. The cave plays tricks on you. You wonder when the halucinations will start."
                }
            ]
        }
    ]
}
