{

    "adventures": [

        {

            "config": {

                "audio": {

                    "path": "https://jitsi-party.s3.amazonaws.com/Satanic+Planet+999+(official+music+video).mp3",

                    "autoPlay": true,

                    "hideControls": true

                }

            },

            "rooms": [

                {

                    "id": "painting",

                    "name": "Cloak on Wall",

                    "text": "The red cloak on the wall looks very fine. You take it off its hook to admire it. When you do, the hook is pulled forward and engages a hidden switch. A clanking mechanism whirs and a panel slides open to reveal a secret door. Beyond the door is shrouded in shadow and a chill fills the air.",

                    "buttons": [

                        {

                            "text": "Enter door",

                            "nextRoom": ["catacombs"]

                        },

                        {

                            "text": "Continue up the stairwell",

                            "nextRoom": ["library"]

                        }

                    ]

                },

                {

                    "id": "catacombs",

                    "name": "a path of temptations",

                    "text": "Donning the cloak you trepadaciously enter the secret door. Descending down a staircase you find yourself outside. A path leads into the woods. You find a note in the pocket of the cloak. It reads: ‘Whatever you do, don’t stray from the path. Love, Mom.’",

                    "buttons": [

                        {

                            "text": "Into the Woods!",

                            "nextRoom": ["fortune"]

                        },

                        {

                            "text": "Go back",

                            "nextRoom": ["library"]

                        }

                    ]

                },

                {

                    "id": "fortune",

                    "name": "Encounter with the wolf",

                    "text": "As you make your way through the trees you hear a gruff voice call to you from beyond the tree line along the path. ‘These woods have such beauty within them. Come pick some flowers.’ Delightful fragrant scents fill the air and you are tempted to see what kind of flowers could produce such a lovely bouquet.",

                    "buttons": [

                        {

                            "text": "Pick flowers”,

                            "nextRoom": ["card"]

                        },

                        {

                          "text": "Stay on path",

                          "nextRoom": ["cemetery"]

                      }

                    ]

                },

                {

                    "id": "card",

                    "name": "Pushing Daisies",

                    "text": "In a clearing you find a cluster of the most intoxicating wildflowers oddly blooming in a patch of moonlight. You pick an assortment. Perhaps they’d make a nice gift for whoever’s mother this coat belongs to. Continuing on you try to find your way back, but you aren’t sure if the path you are now on is the same one as before. Off to your left, farther from the path you see a table laid out for a feast. The gruff voice returns but you still cannot see its owner. ‘A feast fit for royalty, come indulge in the decadence of our Lupercalia offerings.’",

                    "buttons": [

                        {

                            "text": "Check out feast",

                            "nextRoom": ["returnCard"]

                        },

                        {

                            "text": "continue on path",

                            "nextRoom": ["cemetery"]

                        }

                    ]

                },

                {

                    "id": "returnCard",

                    "name": "The Feast of Lupercalia",

                    "text": "You approach the table and are overcome with hunger. Without thinking you gorge yourself on the most decadent of foods. Meade from Gemini’s casks, fruits of untold delectability whose juices run down your chin and stain your clothes. Once sated, you look for the path to continue your journey. You think you can see it, but you also notice the entrance to a cave. Strange markings are scratched in its walls, and a light emanates from inside. You creep closer. Within the cave, you can see an open book on a pedestal. The voice speaks from inside the cave. 'Knowledge is the greatest gift. You've come this far. Eat of the fruit and become as a god.'",

                    "buttons": [

                        {

                            "text": "Enter Cave",

                            "nextRoom": ["trapDoor"]

                        },

                        {

                            "text": "Stay on Path",

                            "nextRoom": ["cemetery"]

                        }

                    ]

                }

            ]

        }

    ]

},
        {
            "config": {},
            "rooms": [ 
               {
                "id": "massAve",
                "name": "MassAve",
                "text": "You are walking along Mass Ave and see the NTB on the corner of Clarendon and Mass Ave. Do you keep walking or turn towards the glowing light away from Dunkin Donuts? Are you man or moth?",
                "buttons": [
                    {
                        "text": "A mere man",
                        "nextRoom": ["kitchen"]
                    },
                    {
                        "text": "A mighty moth",
                        "nextRoom": ["outsideClarendon"]
                    }
                ]
            },
            {
                "id": "outsideClarendon",
                "name": "Outside Clarendon",
                "text": "You mighty moth, you! Are you going to head into Clarendon then? Or do you go ahead for another block or two and see if anyone is around at 24?",
                "buttons": [
                    {
                        "text": "Clarendon",
                        "nextRoom": ["clarendon"]
                    },
                    {
                        "text": "Twenty Four Please",
                        "nextRoom": ["twentyFour"]
                    }
                ]
            }
        ]
        }
    ]
}
