{
    "adventures": [
        {
            "config": {
                "audio": {
                    "autoPlay": true,
                    "hideControls": true,
                    "path": "https://tstvhq.s3.amazonaws.com/music/elevator_ritual.mp3"
                }
            },
            "rooms": [
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "catacombs"
                            ],
                            "text": "Weird... Oh well"
                        },
                        {
                            "nextRoom": [
                                "library"
                            ],
                            "text": "Push on that brick!"
                        }
                    ],
                    "id": "brick",
                    "name": "Loose Brick",
                    "text": "As you head down the stairs, you notice a rather peculiar brick sticking out from the otherwise smooth stone wall."
                },
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "foundry"
                            ],
                            "text": "Enter the left hollow"
                        },
                        {
                            "nextRoom": [
                                "sleepingPorch"
                            ],
                            "text": "Enter the right hollow"
                        }
                    ],
                    "id": "field",
                    "name": "Where even am I?",
                    "text": "As you press on the brick, the others in the wall begin to move inward. They're about to crush you! You close your eyes, anticipating the smush, but, when you open them, find yourself in a wide open field. Before you are two massive trees, each with a hollow at their trunk"
                },
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "desert"
                            ],
                            "text": "Go forward through the double doors"
                        },
                        {
                            "nextRoom": [
                                "cemetery"
                            ],
                            "text": "Climb the stairs to the raised door"
                        }
                    ],
                    "id": "foundry",
                    "name": "Burning, sulfuric smells",
                    "text": "You find yourself in some kind of factory or foundry. The sizzling, bubbling sounds fill the darkened space, only illuminated by the orange glow of molten metal. Crucibles pour the crackling viscous material from one container to another in luminscent streams. The whirring and clanging of the machinery is mesmerizing, but you manage to focus your attention on the layout of the cavernous room. Before you is a set of heavy-looking double doors. To your right, there is a steep flight of stairs leading to a raised door."
                },
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "cabin"
                            ],
                            "text": "Drink the gold liquid"
                        },
                        {
                            "nextRoom": [
                                "frontParlor"
                            ],
                            "text": "Drink the bubbling blue liquid"
                        }
                    ],
                    "id": "desert",
                    "name": "So thirsty...",
                    "text": "You find yourself in a vast desert, sand blowing over the dunes spread before you. The horizon is featureless and there is not a cloud in the sky. The sun beats down mercilessly and you feel the heat beginning to sap your energy and your throat beginning to dry. Stumbling over a dune, you see a small wooden table standing in the middle of the desert all by itself. On it are two golden chalices. One holds a golden, shimmering liquid that smells of fresh fruit. The other is blue, bubbling lightly, and seemingly odorless. Your thirst is rising..."
                },
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "trapDoor"
                            ],
                            "text": "Get up and go through the door"
                        },
                        {
                            "nextRoom": [
                                "sleepingPorch"
                            ],
                            "text": "Let me just rest"
                        }
                    ],
                    "id": "cabin",
                    "name": "Miles to go before I sleep",
                    "text": "In a blink you are lying on an enormous, comfortable bed with sheets that have GOT to be around 350 thread count. Looking around, you see that you are in a cabin, a massive winddow beside the bed overlooking a beautiful snowy landscape. Wind blows the light fluffy snow into swirling patterns between the trees of a dense pine forest. Within this room, there is a crackling fireplace and the herbal, woody smell of chicory. A sturdy wooden door stands by the corner of the room; you debate getting up for a closer look, but this bed is so comfy..."
                }
            ]
        }
