{
    "adventures": [
        {
            "config": {
                "audio": {
                    "autoPlay": true,
                    "hideControls": true,
                  path": "https://s3.us-east-2.amazonaws.com/thesatanic.estate/music/halloween.mp3"
                }
            },
            "rooms": [
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "subway"
                            ],
                            "text": "Weird... Oh well"
                        },
                        {
                            "nextRoom": [
                                "library"
                            ],
                            "text": "Push on that brick!"
                        }
                    ],
                    "id": "brick",
                    "name": "Loose Brick",
                    "text": "As you head down the stairs, you notice a rather peculiar brick sticking out from the otherwise smooth stone wall."
                },
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "train"
                            ],
                            "text": "Take the left-hand train"
                        },
                        {
                            "nextRoom": [
                                "sleepingPorch"
                            ],
                            "text": "Take the right-hand train"
                        }
                    ],
                    "id": "subway",
                    "name": "Now boarding",
                    "text": "As you press on the brick, the entire wall gives way, and you feel yourself stumble forward down a flight of stairs. You fall for what seems like ages before, gathering your senses, you find yourself on a subway platform. Two subway cars wait on either side of you."
                },
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "station"
                            ],
                            "text": "Better just keep to myself"
                        },
                        {
                            "nextRoom": [
                                "cemetery"
                            ],
                            "text": "Let me off!"
                        }
                    ],
                    "id": "train",
                    "name": "Going downtown",
                    "text": "The train is empty as you take a seat; it lurches forward and the lights begin to flicker. Wait a minute - there wasn't anyone in this car a second ago... you see a huddled figure sitting at the other end of the car."
                },
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "cabin"
                            ],
                            "text": "Make a run for it"
                        },
                        {
                            "nextRoom": [
                                "frontParlor"
                            ],
                            "text": "Close your eyes - this HAS to be a dream"
                        }
                    ],
                    "id": "station",
                    "name": "Arrivals",
                    "text": "As you sit the lights continue to flicker. In a blink you begin to hear a soft rasping noise from the bundled figure. The lights flash. Suddenly the figure is one seat closer. Flicker. Another closer. Faster and faster they're moving closer as the train begins to slow. The doors open. The figure is upon you and you can feel the hot, growling breaths of whoever or whatever this is."
                },
                {
                    "buttons": [
                        {
                            "nextRoom": [
                                "trapDoor"
                            ],
                            "text": "Climb the stairs and follow the music"
                        },
                        {
                            "nextRoom": [
                                "sleepingPorch"
                            ],
                            "text": "Take the other train back"
                        }
                    ],
                    "id": "station",
                    "name": "The night is young",
                    "text": "Your heart still racing, you catch your breath on this platform as the train speeds away. You swear you can hear a cackling laugh fade into the darkness along with it. The only other sound is your heartbeat, pumping rhythmically in the dimly lit station. Or is that...music? You can hear it echoing throughout the cavernous tunnels. You turn around to find its source and discover a staircase leading upward. At that moment, another train pulls up to the opposite side of the platform."
                }
            ]
        }
    ]
}
