{
    "adventures": {
        "basementAdventure": {
            "config": {
                "audio": {
                    "path": "https://jitsi-party.s3.amazonaws.com/Satanic+Planet+999+(official+music+video).mp3",
                    "autoPlay": true,
                    "hideControls": true
                }
            },
            "painting": {
                "name": "An Askew Painting",
                "text": "You are standing in the stairwell of The Satanic Temple’s art gallery.  Art galore decorates the rich wallpaper.  One of the paintings is slightly askew.",
                "buttons": [
                    {
                        "text": "Rotate it",
                        "nextRoom": "catacombs"
                    },
                    {
                        "text": "Continue up the stairwell",
                        "nextRoom": "library"
                    }
                ]
            },
            "catacombs": {
                "name": "An Unpredictable Stair",
                "text": "You reach out and right the painting.  An unsettling ratcheting sound echoes in the wall and suddenly the stair you are standing on trundles aside. You tumble into a slide that carries you through cold, dark air, bumping and thumping as you round awkward turns, until it dumps you into a subterranean chamber. A fortune telling machine sits ominously in the center of the rock-hewn floor, and on the machine is a button. There is also a door to your right.",
                "buttons": [
                    {
                        "text": "Push the button",
                        "nextRoom": "fortune"
                    },
                    {
                        "text": "Go through the door",
                        "nextRoom": "library"
                    }
                ]
            },
            "fortune": {
                "name": "Fortune",
                "text": "The machine whirs and rumbles to life. Eyes flashing, the fortune teller says in a lilting Indian accent, ”My name is Madame la Vache. I sense the presence of someone seeking knowledge.  I will now divine your future!“ A card pokes out from a slot below the machine and her eyes grow dim once again. She lurches back into an awkward pose and is silent.",
                "buttons": [
                    {
                        "text": "Pick up the card",
                        "nextRoom": "card"
                    },
                    {
                      "text": "Go through the door",
                      "nextRoom": "library"
                  }
                ]
            },
            "card": {
                "name": "The Card",
                "text": "For possibly the first time, divination has correctly told you something true.  The card reads, ”You are going to die someday.“",
                "buttons": [
                    {
                        "text": "Put the card back",
                        "nextRoom": "returnCard"
                    },
                    {
                        "text": "Go through the door",
                        "nextRoom": "library"
                    }
                ]
            },
            "returnCard": {
                "name": "The Card Return",
                "text": "You place the card back into the slot on the fortune telling machine and it disappears back into the mechanism.  Silence fills the room for a few seconds, then sudden there is a resounding ‘clunk’ of internal mechanisms in the wall.  It opens, revealing a door to your left.",
                "buttons": [
                    {
                        "text": "Go through the left door",
                        "nextRoom": "trapDoor"
                    },
                    {
                        "text": "Go through the right door",
                        "nextRoom": "library"
                    }
                ]
            }
        }
    }
}
