{
    "events": [
        {
            "name": "Surviving Conspiracy Therapy with Evan Anderson in conversation with a victim of recovered memory therapy (pre-recorded)",
            "description": "In depth discussion with a victim of recovered memory therapy.",
            "room": "jude-mirra",
            "start": "2021-04-10T18:00:00-05:00",
            "end": "2021-04-10T19:00:00-05:00",
            "image": "https://tstvhq.s3.amazonaws.com/backgrounds/Faction+Hall+Room+Backgrounds/Grey+Faction+Background+Images/bunny.png"
        },
        {
            "name": "Satanic Panic, QAnon, and Media Misconceptions Panel with Lucien Greaves, Carrie Poppy, Mike Rothschild, and Joe Ondrak.",
            "description": "Co-founder and spokesperson for The Satanic Temple is joined by investigative journalist Carrie Poppy, Mike Rothschild, and Joe Ondrak for general discussion.",
            "room": "auditorium",
            "start": "2021-04-10T16:30:00-05:00",
            "end": "2021-04-10T17:30:00-05:00",
            "image": "https://tstvhq.s3.amazonaws.com/backgrounds/Faction+Hall+Room+Backgrounds/Grey+Faction+Background+Images/calendarflower.png"
        },
        {
            "name": "Origins of the Satanic Panic Panel with Gerard O'Sullivan and Donald Frew in conversation",
            "description": "Two of the co-authors of the 1990 study, 'How the Devil Got Much More than His Due,' will speak to the early history of the Satanism scare as it evolved out of fundamentalist subcultures in the seventies and became a nationwide moral panic in the middle to late 1980s. The panic was fed by overzealous and often religiously invested police, self-appointed experts and investigators, clergy. and a segment of the mental health industry which saw Satanic Ritual Abuse lurking behind every trauma narrative. Many of the same themes and sources have resurfaced in the age of QAnon despite having been repudiated by their own originators.",
            "room": "michelle-tallmadge",
            "start": "2021-04-10T19:30:00-05:00",
            "end": "2021-04-10T20:30:00-05:00",
            "image": "https://tstvhq.s3.amazonaws.com/backgrounds/Faction+Hall+Room+Backgrounds/Grey+Faction+Background+Images/calendarhall.png"
        },
        {
            "name": "Satanic Panic Saturday - A Glimpse Into the Archive",
            "description": "Strange media from the vaults",
            "room": "mkultra",
            "start": "2021-04-10T00:00:00-05:00",
            "end": "2021-04-10T23:59:59-05:00",
            "image": "https://tstvhq.s3.amazonaws.com/backgrounds/Faction+Hall+Room+Backgrounds/Grey+Faction+Background+Images/calendarrobe.png"
        }
    ]
}
